#+TITLE: Baccam Model — Grey-box Recovery with Sampling Design Exploration
#+AUTHOR: Ramakrishna Suresh
#+PROPERTY: header-args:julia-vterm :session *julia* :results output :exports both :dir (projectile-project-root) :tangle yes :comments both
#+STARTUP: inlineimages overview

** Saving the datasets

#+begin_src julia-vterm

for (label, cfg) in configs
    df = DataFrame(
        t      = cfg.t_obs,
        T_true = cfg.Y_true[1, :],
        I_true = cfg.Y_true[2, :],
        V_true = cfg.Y_true[3, :],
        T_mean = cfg.Y_mean[1, :],
        I_mean = cfg.Y_mean[2, :],
        V_mean = cfg.Y_mean[3, :],
    )
    CSV.write(
        joinpath(pwd(), "Results", "Baccam_$(label).csv"),
        df
    )
    println("Saved Baccam_$(label).csv  ($(cfg.n_tp) timepoints × $(cfg.n_mice) mice)")
end
#+end_src

#+RESULTS:
: Saved Baccam_C_20x6.csv  (20 timepoints × 6 mice)
: Saved Baccam_B_10x12.csv  (10 timepoints × 12 mice)
: Saved Baccam_A_5x24.csv  (5 timepoints × 24 mice)

